app/controllers/user_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    page_no = params[:page_no].to_i
    split = 5
    skip_record = (page_no - 1) * split

    user = User.limit(split).offset(skip_record)