app/controllers/user_controller.rb

    def index
        user = User.all
---
SELECT `users`.* FROM `users`

    def create_user
        user = User.new # Create new object for User model class
        user.name = params[:name]
        user.phone_number = params[:phone_number]
        user.password = params[:password]
        type_role = params[:role] # perameter value saved into the local variable type_role

        if Role.is_present_role?(type_role) # if that class method return true that remaining processes will continue
            retrive_role_id =  Role.find_by(role: type_role)&.id
            user.role_id = retrive_role_id
        else
            raise ActiveRecord::RecordNotFound, " Undefined role : #{type_role} "
        end

        if user.save
---
SELECT `roles`.* FROM `roles` WHERE `roles`.`role` = 'user' LIMIT 1
INSERT INTO `users` (`name`, `phone_number`, `password`, `is_active`, `role_id`, `created_at`, `updated_at`) VALUES ('Dharunraj', '9361320511', '1234567890Dh', NULL, 2, '2024-01-07 15:03:43.833685', '2024-01-07 15:03:43.833685')

    def login
        user = User.find_by(phone_number: params[:phone_number])


      if user && User.find_by(password: params[:password])

        if user.role_id == Role.find_by(role: 'admin')&.id
---
SELECT `users`.* FROM `users` WHERE `users`.`phone_number` = '9600678232' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`password` = '1234567890Dh' LIMIT 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`role` = 'admin' LIMIT 1