app/models/role.rb

SELECT `roles`.`role` FROM `roles`
---
    def self.is_present_role?(role_define)
        roles = Role.pluck(:role)  # plunk method return as a array format